ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DD28def.inc
; Clock Selection
.equ TCA_SPLIT_CLKSEL_DIV1_gc = (0x00<<1) ; CLK_PER
.equ TCA_SPLIT_CLKSEL_DIV2_gc = (0x01<<1) ; CLK_PER / 2
.equ TCA_SPLIT_CLKSEL_DIV4_gc = (0x02<<1) ; CLK_PER / 4
.equ TCA_SPLIT_CLKSEL_DIV8_gc = (0x03<<1) ; CLK_PER / 8
.equ TCA_SPLIT_CLKSEL_DIV16_gc = (0x04<<1) ; CLK_PER / 16
.equ TCA_SPLIT_CLKSEL_DIV64_gc = (0x05<<1) ; CLK_PER / 64
.equ TCA_SPLIT_CLKSEL_DIV256_gc = (0x06<<1) ; CLK_PER / 256
.equ TCA_SPLIT_CLKSEL_DIV1024_gc = (0x07<<1) ; CLK_PER / 1024

; Command select
.equ TCA_SPLIT_CMD_NONE_gc = (0x00<<2)   ; No Command
.equ TCA_SPLIT_CMD_UPDATE_gc = (0x01<<2) ; Force Update
.equ TCA_SPLIT_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TCA_SPLIT_CMD_RESET_gc = (0x03<<2)  ; Force Hard Reset

; Command Enable select
.equ TCA_SPLIT_CMDEN_NONE_gc = (0x00<<0) ; None
.equ TCA_SPLIT_CMDEN_BOTH_gc = (0x03<<0) ; Both low byte and high byte counter


;*************************************************************************
;** TCB - 16-bit Timer Type B
;*************************************************************************

; TCB_CTRLA masks
.equ TCB_ENABLE_bm = 0x01                ; Enable bit mask
.equ TCB_ENABLE_bp = 0                   ; Enable bit position
.equ TCB_CLKSEL_gm = 0x0E                ; Clock Select group mask
.equ TCB_CLKSEL_gp = 1                   ; Clock Select group position
.equ TCB_CLKSEL_0_bm = (1<<1)            ; Clock Select bit 0 mask
.equ TCB_CLKSEL_0_bp = 1                 ; Clock Select bit 0 position
.equ TCB_CLKSEL_1_bm = (1<<2)            ; Clock Select bit 1 mask
.equ TCB_CLKSEL_1_bp = 2                 ; Clock Select bit 1 position
.equ TCB_CLKSEL_2_bm = (1<<3)            ; Clock Select bit 2 mask
.equ TCB_CLKSEL_2_bp = 3                 ; Clock Select bit 2 position
.equ TCB_SYNCUPD_bm = 0x10               ; Synchronize Update bit mask
.equ TCB_SYNCUPD_bp = 4                  ; Synchronize Update bit position
.equ TCB_CASCADE_bm = 0x20               ; Cascade two timers bit mask
.equ TCB_CASCADE_bp = 5                  ; Cascade two timers bit position
.equ TCB_RUNSTDBY_bm = 0x40              ; Run Standby bit mask
.equ TCB_RUNSTDBY_bp = 6                 ; Run Standby bit position

; TCB_CTRLB masks
.equ TCB_CNTMODE_gm = 0x07               ; Timer Mode group mask
.equ TCB_CNTMODE_gp = 0                  ; Timer Mode group position
.equ TCB_CNTMODE_0_bm = (1<<0)           ; Timer Mode bit 0 mask
.equ TCB_CNTMODE_0_bp = 0                ; Timer Mode bit 0 position
.equ TCB_CNTMODE_1_bm = (1<<1)           ; Timer Mode bit 1 mask
.equ TCB_CNTMODE_1_bp = 1                ; Timer Mode bit 1 position
.equ TCB_CNTMODE_2_bm = (1<<2)           ; Timer Mode bit 2 mask
.equ TCB_CNTMODE_2_bp = 2                ; Timer Mode bit 2 position
.equ TCB_CCMPEN_bm = 0x10                ; Pin Output Enable bit mask
.equ TCB_CCMPEN_bp = 4                   ; Pin Output Enable bit position
.equ TCB_CCMPINIT_bm = 0x20              ; Pin Initial State bit mask
.equ TCB_CCMPINIT_bp = 5                 ; Pin Initial State bit position
.equ TCB_ASYNC_bm = 0x40                 ; Asynchronous Enable bit mask
.equ TCB_ASYNC_bp = 6                    ; Asynchronous Enable bit position

; TCB_EVCTRL masks
.equ TCB_CAPTEI_bm = 0x01                ; Event Input Enable bit mask
.equ TCB_CAPTEI_bp = 0                   ; Event Input Enable bit position
.equ TCB_EDGE_bm = 0x10                  ; Event Edge bit mask
.equ TCB_EDGE_bp = 4                     ; Event Edge bit position
.equ TCB_FILTER_bm = 0x40                ; Input Capture Noise Cancellation Filter bit mask
.equ TCB_FILTER_bp = 6                   ; Input Capture Noise Cancellation Filter bit position

; TCB_INTCTRL masks
.equ TCB_CAPT_bm = 0x01                  ; Capture or Timeout bit mask
.equ TCB_CAPT_bp = 0                     ; Capture or Timeout bit position
.equ TCB_OVF_bm = 0x02                   ; Overflow bit mask
.equ TCB_OVF_bp = 1                      ; Overflow bit position

; TCB_INTFLAGS masks
; Masks for TCB_CAPT already defined
; Masks for TCB_OVF already defined

; TCB_STATUS masks
.equ TCB_RUN_bm = 0x01                   ; Run bit mask
.equ TCB_RUN_bp = 0                      ; Run bit position

; TCB_DBGCTRL masks
.equ TCB_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TCB_DBGRUN_bp = 0                   ; Debug Run bit position

; Clock Select
.equ TCB_CLKSEL_DIV1_gc = (0x00<<1)      ; CLK_PER
.equ TCB_CLKSEL_DIV2_gc = (0x01<<1)      ; CLK_PER/2
.equ TCB_CLKSEL_TCA0_gc = (0x02<<1)      ; Use CLK_TCA from TCA0
.equ TCB_CLKSEL_EVENT_gc = (0x07<<1)     ; Count on event edge

; Timer Mode select
.equ TCB_CNTMODE_INT_gc = (0x00<<0)      ; Periodic Interrupt
.equ TCB_CNTMODE_TIMEOUT_gc = (0x01<<0)  ; Periodic Timeout
.equ TCB_CNTMODE_CAPT_gc = (0x02<<0)     ; Input Capture Event
.equ TCB_CNTMODE_FRQ_gc = (0x03<<0)      ; Input Capture Frequency measurement
.equ TCB_CNTMODE_PW_gc = (0x04<<0)       ; Input Capture Pulse-Width measurement
.equ TCB_CNTMODE_FRQPW_gc = (0x05<<0)    ; Input Capture Frequency and Pulse-Width measurement
.equ TCB_CNTMODE_SINGLE_gc = (0x06<<0)   ; Single Shot
.equ TCB_CNTMODE_PWM8_gc = (0x07<<0)     ; 8-bit PWM


;*************************************************************************
;** TCD - Timer Counter D
;*************************************************************************

; TCD_CTRLA masks
.equ TCD_ENABLE_bm = 0x01                ; Enable bit mask
.equ TCD_ENABLE_bp = 0                   ; Enable bit position
.equ TCD_SYNCPRES_gm = 0x06              ; Synchronization prescaler group mask
.equ TCD_SYNCPRES_gp = 1                 ; Synchronization prescaler group position
.equ TCD_SYNCPRES_0_bm = (1<<1)          ; Synchronization prescaler bit 0 mask
.equ TCD_SYNCPRES_0_bp = 1               ; Synchronization prescaler bit 0 position
.equ TCD_SYNCPRES_1_bm = (1<<2)          ; Synchronization prescaler bit 1 mask
.equ TCD_SYNCPRES_1_bp = 2               ; Synchronization prescaler bit 1 position
.equ TCD_CNTPRES_gm = 0x18               ; Counter prescaler group mask
.equ TCD_CNTPRES_gp = 3                  ; Counter prescaler group position
.equ TCD_CNTPRES_0_bm = (1<<3)           ; Counter prescaler bit 0 mask
.equ TCD_CNTPRES_0_bp = 3                ; Counter prescaler bit 0 position
.equ TCD_CNTPRES_1_bm = (1<<4)           ; Counter prescaler bit 1 mask
.equ TCD_CNTPRES_1_bp = 4                ; Counter prescaler bit 1 position
.equ TCD_CLKSEL_gm = 0x60                ; Clock select group mask
.equ TCD_CLKSEL_gp = 5                   ; Clock select group position
.equ TCD_CLKSEL_0_bm = (1<<5)            ; Clock select bit 0 mask
.equ TCD_CLKSEL_0_bp = 5                 ; Clock select bit 0 position
.equ TCD_CLKSEL_1_bm = (1<<6)            ; Clock select bit 1 mask
.equ TCD_CLKSEL_1_bp = 6                 ; Clock select bit 1 position

; TCD_CTRLB masks
.equ TCD_WGMODE_gm = 0x03                ; Waveform generation mode group mask
.equ TCD_WGMODE_gp = 0                   ; Waveform generation mode group position
.equ TCD_WGMODE_0_bm = (1<<0)            ; Waveform generation mode bit 0 mask
.equ TCD_WGMODE_0_bp = 0                 ; Waveform generation mode bit 0 position
.equ TCD_WGMODE_1_bm = (1<<1)            ; Waveform generation mode bit 1 mask
.equ TCD_WGMODE_1_bp = 1                 ; Waveform generation mode bit 1 position

; TCD_CTRLC masks
.equ TCD_CMPOVR_bm = 0x01                ; Compare output value override bit mask
.equ TCD_CMPOVR_bp = 0                   ; Compare output value override bit position
.equ TCD_AUPDATE_bm = 0x02               ; Auto update bit mask
.equ TCD_AUPDATE_bp = 1                  ; Auto update bit position
.equ TCD_FIFTY_bm = 0x08                 ; Fifty percent waveform bit mask
.equ TCD_FIFTY_bp = 3                    ; Fifty percent waveform bit position
.equ TCD_CMPCSEL_bm = 0x40               ; Compare C output select bit mask
.equ TCD_CMPCSEL_bp = 6                  ; Compare C output select bit position
.equ TCD_CMPDSEL_bm = 0x80               ; Compare D output select bit mask
.equ TCD_CMPDSEL_bp = 7                  ; Compare D output select bit position

; TCD_CTRLD masks
.equ TCD_CMPAVAL_gm = 0x0F               ; Compare A value group mask
.equ TCD_CMPAVAL_gp = 0                  ; Compare A value group position
.equ TCD_CMPAVAL_0_bm = (1<<0)           ; Compare A value bit 0 mask
.equ TCD_CMPAVAL_0_bp = 0                ; Compare A value bit 0 position
.equ TCD_CMPAVAL_1_bm = (1<<1)           ; Compare A value bit 1 mask
.equ TCD_CMPAVAL_1_bp = 1                ; Compare A value bit 1 position
.equ TCD_CMPAVAL_2_bm = (1<<2)           ; Compare A value bit 2 mask
.equ TCD_CMPAVAL_2_bp = 2                ; Compare A value bit 2 position
.equ TCD_CMPAVAL_3_bm = (1<<3)           ; Compare A value bit 3 mask
.equ TCD_CMPAVAL_3_bp = 3                ; Compare A value bit 3 position
.equ TCD_CMPBVAL_gm = 0xF0               ; Compare B value group mask
.equ TCD_CMPBVAL_gp = 4                  ; Compare B value group position
.equ TCD_CMPBVAL_0_bm = (1<<4)           ; Compare B value bit 0 mask
.equ TCD_CMPBVAL_0_bp = 4                ; Compare B value bit 0 position
.equ TCD_CMPBVAL_1_bm = (1<<5)           ; Compare B value bit 1 mask
.equ TCD_CMPBVAL_1_bp = 5                ; Compare B value bit 1 position
.equ TCD_CMPBVAL_2_bm = (1<<6)           ; Compare B value bit 2 mask
.equ TCD_CMPBVAL_2_bp = 6                ; Compare B value bit 2 position
.equ TCD_CMPBVAL_3_bm = (1<<7)           ; Compare B value bit 3 mask
.equ TCD_CMPBVAL_3_bp = 7                ; Compare B value bit 3 position

; TCD_CTRLE masks
.equ TCD_SYNCEOC_bm = 0x01               ; Synchronize end of cycle strobe bit mask
.equ TCD_SYNCEOC_bp = 0                  ; Synchronize end of cycle strobe bit position
.equ TCD_SYNC_bm = 0x02                  ; synchronize strobe bit mask
.equ TCD_SYNC_bp = 1                     ; synchronize strobe bit position
.equ TCD_RESTART_bm = 0x04               ; Restart strobe bit mask
.equ TCD_RESTART_bp = 2                  ; Restart strobe bit position
.equ TCD_SCAPTUREA_bm = 0x08             ; Software Capture A Strobe bit mask
.equ TCD_SCAPTUREA_bp = 3                ; Software Capture A Strobe bit position
.equ TCD_SCAPTUREB_bm = 0x10             ; Software Capture B Strobe bit mask
.equ TCD_SCAPTUREB_bp = 4                ; Software Capture B Strobe bit position
.equ TCD_DISEOC_bm = 0x80                ; Disable at end of cycle bit mask
.equ TCD_DISEOC_bp = 7                   ; Disable at end of cycle bit position

; TCD_EVCTRLA masks
.equ TCD_TRIGEI_bm = 0x01                ; Trigger event enable bit mask
.equ TCD_TRIGEI_bp = 0                   ; Trigger event enable bit position
.equ TCD_ACTION_bm = 0x04                ; Event action bit mask
.equ TCD_ACTION_bp = 2                   ; Event action bit position
.equ TCD_EDGE_bm = 0x10                  ; Edge select bit mask
.equ TCD_EDGE_bp = 4                     ; Edge select bit position
.equ TCD_CFG_gm = 0xC0                   ; Event config group mask
.equ TCD_CFG_gp = 6                      ; Event config group position
.equ TCD_CFG_0_bm = (1<<6)               ; Event config bit 0 mask
.equ TCD_CFG_0_bp = 6                    ; Event config bit 0 position
.equ TCD_CFG_1_bm = (1<<7)               ; Event config bit 1 mask
.equ TCD_CFG_1_bp = 7                    ; Event config bit 1 position

; TCD_EVCTRLB masks
; Masks for TCD_TRIGEI already defined
; Masks for TCD_ACTION already defined
; Masks for TCD_EDGE already defined
; Masks for TCD_CFG already defined

; TCD_INTCTRL masks
.equ TCD_OVF_bm = 0x01                   ; Overflow interrupt enable bit mask
.equ TCD_OVF_bp = 0                      ; Overflow interrupt enable bit position
.equ TCD_TRIGA_bm = 0x04                 ; Trigger A interrupt enable bit mask
.equ TCD_TRIGA_bp = 2                    ; Trigger A interrupt enable bit position
.equ TCD_TRIGB_bm = 0x08                 ; Trigger B interrupt enable bit mask
.equ TCD_TRIGB_bp = 3                    ; Trigger B interrupt enable bit position

; TCD_INTFLAGS masks
; Masks for TCD_OVF already defined
; Masks for TCD_TRIGA already defined
; Masks for TCD_TRIGB already defined

; TCD_STATUS masks
.equ TCD_ENRDY_bm = 0x01                 ; Enable ready bit mask
.equ TCD_ENRDY_bp = 0                    ; Enable ready bit position
.equ TCD_CMDRDY_bm = 0x02                ; Command ready bit mask
.equ TCD_CMDRDY_bp = 1                   ; Command ready bit position
.equ TCD_PWMACTA_bm = 0x40               ; PWM activity on A bit mask
.equ TCD_PWMACTA_bp = 6                  ; PWM activity on A bit position
.equ TCD_PWMACTB_bm = 0x80               ; PWM activity on B bit mask
.equ TCD_PWMACTB_bp = 7                  ; PWM activity on B bit position

; TCD_INPUTCTRLA masks
.equ TCD_INPUTMODE_gm = 0x0F             ; Input mode group mask
.equ TCD_INPUTMODE_gp = 0                ; Input mode group position
.equ TCD_INPUTMODE_0_bm = (1<<0)         ; Input mode bit 0 mask
.equ TCD_INPUTMODE_0_bp = 0              ; Input mode bit 0 position
.equ TCD_INPUTMODE_1_bm = (1<<1)         ; Input mode bit 1 mask
.equ TCD_INPUTMODE_1_bp = 1              ; Input mode bit 1 position
.equ TCD_INPUTMODE_2_bm = (1<<2)         ; Input mode bit 2 mask
.equ TCD_INPUTMODE_2_bp = 2              ; Input mode bit 2 position
.equ TCD_INPUTMODE_3_bm = (1<<3)         ; Input mode bit 3 mask
.equ TCD_INPUTMODE_3_bp = 3              ; Input mode bit 3 position

; TCD_INPUTCTRLB masks
; Masks for TCD_INPUTMODE already defined

; TCD_FAULTCTRL masks
.equ TCD_CMPA_bm = 0x01                  ; Compare A value bit mask
.equ TCD_CMPA_bp = 0                     ; Compare A value bit position
.equ TCD_CMPB_bm = 0x02                  ; Compare B value bit mask
.equ TCD_CMPB_bp = 1                     ; Compare B value bit position
.equ TCD_CMPC_bm = 0x04                  ; Compare C value bit mask
.equ TCD_CMPC_bp = 2                     ; Compare C value bit position
.equ TCD_CMPD_bm = 0x08                  ; Compare D vaule bit mask
.equ TCD_CMPD_bp = 3                     ; Compare D vaule bit position
.equ TCD_CMPAEN_bm = 0x10                ; Compare A enable bit mask
.equ TCD_CMPAEN_bp = 4                   ; Compare A enable bit position
.equ TCD_CMPBEN_bm = 0x20                ; Compare B enable bit mask
.equ TCD_CMPBEN_bp = 5                   ; Compare B enable bit position
.equ TCD_CMPCEN_bm = 0x40                ; Compare C enable bit mask
.equ TCD_CMPCEN_bp = 6                   ; Compare C enable bit position
.equ TCD_CMPDEN_bm = 0x80                ; Compare D enable bit mask
.equ TCD_CMPDEN_bp = 7                   ; Compare D enable bit position

; TCD_DLYCTRL masks
.equ TCD_DLYSEL_gm = 0x03                ; Delay select group mask
.equ TCD_DLYSEL_gp = 0                   ; Delay select group position
.equ TCD_DLYSEL_0_bm = (1<<0)            ; Delay select bit 0 mask
.equ TCD_DLYSEL_0_bp = 0                 ; Delay select bit 0 position
.equ TCD_DLYSEL_1_bm = (1<<1)            ; Delay select bit 1 mask
.equ TCD_DLYSEL_1_bp = 1                 ; Delay select bit 1 position
.equ TCD_DLYTRIG_gm = 0x0C               ; Delay trigger group mask
.equ TCD_DLYTRIG_gp = 2                  ; Delay trigger group position
.equ TCD_DLYTRIG_0_bm = (1<<2)           ; Delay trigger bit 0 mask
.equ TCD_DLYTRIG_0_bp = 2                ; Delay trigger bit 0 position
.equ TCD_DLYTRIG_1_bm = (1<<3)           ; Delay trigger bit 1 mask
.equ TCD_DLYTRIG_1_bp = 3                ; Delay trigger bit 1 position
.equ TCD_DLYPRESC_gm = 0x30              ; Delay prescaler group mask
.equ TCD_DLYPRESC_gp = 4                 ; Delay prescaler group position
.equ TCD_DLYPRESC_0_bm = (1<<4)          ; Delay prescaler bit 0 mask
.equ TCD_DLYPRESC_0_bp = 4               ; Delay prescaler bit 0 position
.equ TCD_DLYPRESC_1_bm = (1<<5)          ; Delay prescaler bit 1 mask
.equ TCD_DLYPRESC_1_bp = 5               ; Delay prescaler bit 1 position

